# CannotPasteNoWorkplane Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotPasteNoWorkplane Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Can't paste because there is no corresponding Work Plane. Set workplane or switch to view with appropriate workplane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPasteNoWorkplane { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPasteNoWorkplane As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPasteNoWorkplane {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace